In [255]:
import numpy as np
import pandas as pd

In [452]:
df = pd.DataFrame.from_dict({'    a':[1,np.nan,2,3,4,None], 'b': [4,5,5,6,7,8], 'c': [' alkjlkj', 'b', 'b','c', 'd', 'e']})

In [453]:
df.isnull().sum()/df.isnull().count()
df

       a  b         c
0    1.0  4   alkjlkj
1    NaN  5         b
2    2.0  5         b
3    3.0  6         c
4    4.0  7         d
5    NaN  8         e

In [454]:
df.columns

Index(['    a', 'b', 'c'], dtype='object')

In [455]:
df.columns = df.columns.str.strip()

In [456]:
df.rename({'b':'B', 'a':'A'}, axis = 1).columns

Index(['A', 'B', 'c'], dtype='object')

In [457]:
from datetime import date, time, datetime

In [458]:
df.columns = df.rename({'b':'B', 'a':'A'}, axis = 1).columns
df['Time'] = ['10/25/2005','10/29/2002','01/01/2001', '03/04/2019', '04/23/2000', '02/15/1990']
df['TimeFT'] = pd.to_datetime(df['Time'])
df

     A  B         c        Time     TimeFT
0  1.0  4   alkjlkj  10/25/2005 2005-10-25
1  NaN  5         b  10/29/2002 2002-10-29
2  2.0  5         b  01/01/2001 2001-01-01
3  3.0  6         c  03/04/2019 2019-03-04
4  4.0  7         d  04/23/2000 2000-04-23
5  NaN  8         e  02/15/1990 1990-02-15

In [459]:
df[df['B']<6]

     A  B         c        Time     TimeFT
0  1.0  4   alkjlkj  10/25/2005 2005-10-25
1  NaN  5         b  10/29/2002 2002-10-29
2  2.0  5         b  01/01/2001 2001-01-01

In [460]:
df[pd.to_numeric(df['TimeFT'].apply(lambda x: x.strftime('%Y')))< 2000]

    A  B  c        Time     TimeFT
5 NaN  8  e  02/15/1990 1990-02-15

In [461]:
df['A'] = df['A'].astype(str)

In [462]:
df['A'] = pd.to_numeric(df['A'], errors= 'coerce')
df['A'][0]

1.0

In [466]:
s = pd.get_dummies(df['c'])
s

    alkjlkj  b  c  d  e
0         1  0  0  0  0
1         0  1  0  0  0
2         0  1  0  0  0
3         0  0  1  0  0
4         0  0  0  1  0
5         0  0  0  0  1

In [441]:
dummies = df['c'].str.get_dummies()
dummies

    a  b  c  d  e
0   1  0  0  0  0
1   0  1  0  0  0
2   0  1  0  0  0
3   0  0  1  0  0
4   0  0  0  1  0
5   0  0  0  0  1

In [427]:
pd.get_dummies(df, columns = ['c'], drop_first = True)

     A  B        Time     TimeFT  c_b  c_c  c_d  c_e
0  1.0  4  10/25/2005 2005-10-25    0    0    0    0
1  NaN  5  10/29/2002 2002-10-29    1    0    0    0
2  2.0  5  01/01/2001 2001-01-01    1    0    0    0
3  3.0  6  03/04/2019 2019-03-04    0    1    0    0
4  4.0  7  04/23/2000 2000-04-23    0    0    1    0
5  NaN  8  02/15/1990 1990-02-15    0    0    0    1

In [265]:
df.isnull().sum()

a        2
b        0
c        0
a mod    2
dtype: int64

In [266]:
df.count()

a        4
b        6
c        6
a mod    4
dtype: int64

In [124]:
[(x, 'unique values:', df[x].unique().tolist()) for x in df]

[('a', 'unique values:', [1.0, nan, 2.0, 3.0, 4.0]),
 ('b', 'unique values:', [4, 5, 6, 7, 8]),
 ('c', 'unique values:', ['a', 'b', 'c', 'd', 'e'])]

In [141]:
pd.DataFrame([df[x].value_counts().values for x in df], index = df.columns)

   0  1  2  3    4
a  1  1  1  1  NaN
b  2  1  1  1  1.0
c  2  1  1  1  1.0

In [139]:
df.columns[::-1]

Index(['c', 'b', 'a'], dtype='object')

In [471]:
df2 = pd.DataFrame({'a':['gets','gets','gets','gets','gots','gots','gots','gots'], 'b': [1,2,1,2,3,4,3,4], 'obs': ['a','b','c','d','e','f','g','h']})

In [500]:
gb = df2.groupby(['a','obs'])['b'].sum()
gb

a     obs
gets  a      1
      b      2
      c      1
      d      2
gots  e      3
      f      4
      g      3
      h      4
Name: b, dtype: int64

In [76]:
pd.crosstab(df2['a'],[df2['b'],df2['obs']])

b     1     2     3     4
obs   a  c  b  d  e  g  f  h
a
gets  1  1  1  1  0  0  0  0
gots  0  0  0  0  1  1  1  1

In [ ]:
{'a':['gets','gets','gets','gets','gots''gots','gots','gots'], 'b': [1,2,1,2,3,4,3,4], 'obs': ['a','b','c','d','e','f','g','h']}

In [361]:
from datetime import datetime

now = datetime.now() # current date and time

now

datetime.datetime(2020, 6, 16, 20, 37, 57, 455248)

In [ ]:
year = now.strftime("%Y")
print("year:", year)

month = now.strftime("%m")
print("month:", month)

day = now.strftime("%d")
print("day:", day)

time = now.strftime("%H:%M:%S")
print("time:", time)

date_time = now.strftime("%m/%d/%Y, %H:%M:%S")
print("date and time:",date_time)

In [503]:
df3 = pd.DataFrame({'A':['a','b', 'c'], 'B': [10,10, 11], 'C':['x', 'x', 'y']})
df3

   A   B  C
0  a  10  x
1  b  10  x
2  c  11  y

In [508]:
pivot = pd.pivot(df3, index='A', columns='C', values='B').reset_index()
pivot

C  A     x     y
0  a  10.0   NaN
1  b  10.0   NaN
2  c   NaN  11.0

In [509]:
melt = pd.melt(pivot, id_vars='A', value_vars=['x','y'], var_name='C', value_name='B')
melt

   A  C     B
0  a  x  10.0
1  b  x  10.0
2  c  x   NaN
3  a  y   NaN
4  b  y   NaN
5  c  y  11.0